## Production: cognito
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 2 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                        = "ca-central-1_eSTGTCw33"
        name                      = "forms_user_pool"
        tags                      = {}
        # (10 unchanged attributes hidden)

      ~ lambda_config {
          + pre_sign_up = (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_email_sender will be updated in-place
  ~ resource "aws_lambda_function" "cognito_email_sender" {
        id                             = "Cognito_Email_Sender"
      ~ last_modified                  = "2023-04-28T12:04:06.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:3",
        ] -> (known after apply)
      ~ runtime                        = "nodejs14.x" -> "nodejs16.x"
      ~ source_code_hash               = "PMktRgvQMBCrirmATRa3pyXeVC3XumLVF2J3hCEZxL4=" -> "kHBj/FHrEPmo2RxFtFGw2DUd2ChyutC7uPNfd9zgL/c="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_pre_sign_up will be created
  + resource "aws_lambda_function" "cognito_pre_sign_up" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/pre_sign_up_main.zip"
      + function_name                  = "Cognito_Pre_Sign_Up"
      + handler                        = "pre_sign_up.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_cognito_lambda"
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "QTDI90Q+x/QfDnbowk26CzT+EGf4lzBQCRoJniGB88s="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_layer_version.cognito_email_sender_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "cognito_email_sender_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:3" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ compatible_runtimes         = [ # forces replacement
          - "nodejs12.x",
          - "nodejs14.x",
          + "nodejs16.x",
        ]
      ~ created_date                = "2023-04-28T12:04:05.693+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:cognito_email_sender_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "mj3xFAkbjq9BYqOptCmrtttWEwC/moq0BfMnSi8L0u0=" -> "c+eGdPnzn4i6o3ffu7Y/K0Lk69/eTjIvSvDkf5SOk54=" # forces replacement
      ~ source_code_size            = 14101894 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_cognito will be destroyed
  # (because aws_lambda_permission.allow_cognito is not in configuration)
  - resource "aws_lambda_permission" "allow_cognito" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "Cognito_Email_Sender" -> null
      - id            = "terraform-20230104151903403600000005" -> null
      - principal     = "cognito-idp.amazonaws.com" -> null
      - source_arn    = "arn:aws:cognito-idp:ca-central-1:957818836222:userpool/ca-central-1_eSTGTCw33" -> null
      - statement_id  = "terraform-20230104151903403600000005" -> null
    }

  # aws_lambda_permission.allow_cognito_to_call_cognito_email_sender_lambda will be created
  + resource "aws_lambda_permission" "allow_cognito_to_call_cognito_email_sender_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Cognito_Email_Sender"
      + id            = (known after apply)
      + principal     = "cognito-idp.amazonaws.com"
      + source_arn    = "arn:aws:cognito-idp:ca-central-1:957818836222:userpool/ca-central-1_eSTGTCw33"
      + statement_id  = (known after apply)
    }

  # aws_lambda_permission.allow_cognito_to_call_cognito_pre_sign_up_lambda will be created
  + resource "aws_lambda_permission" "allow_cognito_to_call_cognito_pre_sign_up_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Cognito_Pre_Sign_Up"
      + id            = (known after apply)
      + principal     = "cognito-idp.amazonaws.com"
      + source_arn    = "arn:aws:cognito-idp:ca-central-1:957818836222:userpool/ca-central-1_eSTGTCw33"
      + statement_id  = (known after apply)
    }

Plan: 4 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
